TJRSchmidbauer/aiuto-vista/sdkconfig.defaults
# Aiuto-Vista sdkconfig defaults (ESP32, Cheap Yellow Display 2432S028)
CONFIG_IDF_TARGET="esp32"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# Touch: axis flags stay OFF, calibration is done in software (bsp_display.c)
# CONFIG_CYD_TOUCH_SWAP_XY is not set
# CONFIG_CYD_TOUCH_MIRROR_X is not set
# CONFIG_CYD_TOUCH_MIRROR_Y is not set
